tap 'homebrew/services'

cask 'karabiner-elements'
cask 'brave-browser'
cask 'homebrew/cask-versions/google-chrome-beta'
cask 'whatsapp'
cask 'spotify'
cask 'telegram'
cask 'slack'
cask 'the-unarchiver'
cask 'google-backup-and-sync'
cask 'nordvpn'
cask 'caffeine'
cask 'shiftit'
cask 'rescuetime'
cask 'kindle'
cask 'send-to-kindle'
cask 'eqmac'
cask 'stremio'
cask 'homebrew/cask-drivers/logitech-options'

brew 'svn'

# Fonts
tap 'homebrew/cask-fonts'
cask 'font-hack'
cask 'font-droid-sans-mono-for-powerline'
cask 'font-roboto-mono-for-powerline'
cask 'font-menlo-for-powerline'
cask 'font-dejavu-sans-mono-for-powerline'
cask 'font-powerline-symbols'
cask 'font-source-code-pro-for-powerline'

# Emacs
tap 'd12frosted/emacs-plus'
brew 'emacs-plus@28 --with-native-comp'
