tap 'homebrew/services'

# Essential tools
brew 'coreutils'
brew 'binutils'
brew 'diffutils'
brew 'findutils'
brew 'fd'
brew 'ripgrep'
brew 'htop'
brew 'tree'
brew 'colordiff'
brew 'jq'
brew 'markdown'
brew 'fzf'
brew 'shellcheck'

# Zsh
brew 'zsh'
brew 'zsh-completions'

# Git
brew 'git'
brew 'git-lfs'

brew 'pirj/homebrew-noclamshell/noclamshell'

# Tmux
brew 'tmux'

# Makes copying and pasting in Terminal.app work again on MacOS Sierra
# https://github.com/tmux/tmux/issues/543#issuecomment-248980734
# https://github.com/tmux/tmux/issues/543
brew 'reattach-to-user-namespace'

# Vim
brew 'vim'
brew 'neovim'

# Cask apps
cask 'karabiner-elements' 
cask 'kitty'
cask 'brave-browser'
cask 'homebrew/cask-versions/google-chrome-beta'
cask 'spotify'
cask 'whatsapp'
cask 'telegram'
# cask 'slack'
cask 'the-unarchiver'
cask 'google-drive'
cask 'caffeine'
cask 'shiftit'
cask 'rescuetime'
cask 'send-to-kindle'
cask 'eqmac'
cask 'homebrew/cask-drivers/logitech-options'
cask 'discord'

# Emacs
tap 'd12frosted/emacs-plus'
brew 'emacs-plus@28 --with-native-comp'

# Clojure
brew 'clojure'
brew 'leiningen'
brew 'candid82/brew/joker'
brew 'borkdude/brew/clj-kondo'
brew 'clojure-lsp/brew/clojure-lsp-native'

# Docker
brew 'docker'

# JS
brew 'npm'

# Elixir
brew 'elixir'

# Go
brew 'go'

# Python
brew 'pyenv'

# Ruby
brew 'rbenv'
brew 'ruby-build'

# Fonts
tap 'homebrew/cask-fonts'
cask 'font-hack'
cask 'font-droid-sans-mono-for-powerline'
cask 'font-roboto-mono-for-powerline'
cask 'font-menlo-for-powerline'
cask 'font-dejavu-sans-mono-for-powerline'
cask 'font-powerline-symbols'
cask 'font-source-code-pro-for-powerline'
