tap 'homebrew/services'

# Essential tools
brew 'coreutils'
brew 'binutils'
brew 'diffutils'
brew 'findutils'
brew 'fd'
brew 'ripgrep'
brew 'htop'
brew 'tree'
brew 'colordiff'
brew 'jq'
brew 'markdown'

# Cask apps
cask 'karabiner-elements' 
cask 'brave-browser'
cask 'homebrew/cask-versions/google-chrome-beta'
cask 'spotify'
cask 'whatsapp'
cask 'telegram'
# cask 'slack'
cask 'the-unarchiver'
cask 'google-drive'
cask 'caffeine'
cask 'shiftit'
cask 'rescuetime'
cask 'send-to-kindle'
cask 'eqmac'
cask 'homebrew/cask-drivers/logitech-options'

# Fonts
tap 'homebrew/cask-fonts'
cask 'font-hack'
cask 'font-droid-sans-mono-for-powerline'
cask 'font-roboto-mono-for-powerline'
cask 'font-menlo-for-powerline'
cask 'font-dejavu-sans-mono-for-powerline'
cask 'font-powerline-symbols'
cask 'font-source-code-pro-for-powerline'

# Emacs
tap 'd12frosted/emacs-plus'
brew 'emacs-plus@28 --with-native-comp'

# Clojure
brew 'clojure'
brew 'leiningen'
brew 'candid82/brew/joker'
brew 'borkdude/brew/clj-kondo'
brew 'clojure-lsp/brew/clojure-lsp-native'

# Elixir
brew 'elixir'
